Repository: habibdev971/deligo_driver
Catalog: lib/l10n/intl_*.arb
Languages: pt

# helloText
source: Hello...
pt: Olá...

source: Welcome Back!
pt: Bem-vindo de volta!

# enterPhoneDes
source: Enter your phone number to continue your ride and stay updated.
pt: Digite seu número de telefone para continuar sua viagem e ficar atualizado.

source: Phone No
pt: Número de telefone

source: Log in / Sign up
pt: Entrar / Cadastrar

source: Enter phone number
pt: Digite o número de telefone

# phoneMinLengthError
source: Phone number must be at least 6 digits
pt: O número de telefone deve ter pelo menos 6 dígitos

# otp_enter_title
source: Enter Your OTP
pt: Digite seu OTP

# otp_sent_message
source: We sent OTP code to your phone number
pt: Enviamos o código OTP para seu número de telefone

# otp_input_hint
source: Write Your OTP
pt: Escreva seu OTP

# otp_resend
source: Resend
pt: Reenviar

# otp_resend_timer
source: Resend code in 00:{secondsRemaining}
pt: Reenviar código em 00:{secondsRemaining}

# otp_save_button
source: Save
pt: Salvar

# password_label
source: Password
pt: Senha

# password_hint
source: Set a Strong Password
pt: Defina uma senha forte

# password_requirements
source: Use at least {length} characters with letters, numbers, and symbols.
pt: Use pelo menos {length} caracteres com letras, números e símbolos.

source: Confirm Password
pt: Confirmar senha

# password_mismatch
source: Passwords do not match.
pt: As senhas não coincidem.

# field_required
source: This field is required
pt: Este campo é obrigatório

# min_length_error
source: Must be at least {length} characters
pt: Deve ter pelo menos {length} caracteres

# name_label
source: Name
pt: Nome

# gender_label
source: Gender
pt: Gênero

# gender_male
source: Male
pt: Masculino

# gender_female
source: Female
pt: Feminino

# gender_other
source: Other
pt: Outro

# gender_select
source: Select Gender
pt: Selecione o gênero

source: Personal Info
pt: Informações Pessoais

source: Add Driver Personal Info
pt: Adicionar informações pessoais do motorista

# enter_details_complete_profile
source: Enter your details to complete your profile and enhance your experience.
pt: Insira seus dados para completar seu perfil e melhorar sua experiência.

source: Profile Image
pt: Imagem de perfil

# profile_image_required
source: Profile image is required
pt: Imagem de perfil é obrigatória

source: Next
pt: Próximo

source: All field required
pt: Todos os campos são obrigatórios

source: Emergency Phone
pt: Telefone de emergência

source: Address
pt: Endereço

source: Driver Documents
pt: Documentos do motorista

source: Add Driver Documents
pt: Adicionar documentos do motorista

# upload_driver_documents
source: Upload your driver documents to complete verification and start driving. Quick, easy, and secure!
pt: Envie seus documentos do motorista para concluir a verificação e começar a dirigir. Rápido, fácil e seguro!

source: Vehicle Name
pt: Nome do veículo

source: Enter vehicle name
pt: Digite o nome do veículo

source: Vehicle Type
pt: Tipo de veículo

source: Select vehicle type
pt: Selecione o tipo de veículo

source: Vehicle Color
pt: Cor do veículo

source: Select vehicle color
pt: Selecione a cor do veículo

source: Plate Number
pt: Número da placa

# enter_plate_number
source: Enter plate no
pt: Digite o número da placa

source: NID Photo
pt: Foto do NID

source: Driving License
pt: Carteira de motorista

source: Vehicle Papers
pt: Documentos do veículo

source: Upload
pt: Enviar

# driving_license_required
source: Driving License is required
pt: Carteira de motorista é obrigatória

source: Vehicle Papers required
pt: Documentos do veículo são obrigatórios

# nid_image_required
source: NID image is required
pt: Imagem do NID é obrigatória

source: Production Year
pt: Ano de fabricação

source: Vehicle Production Year
pt: Ano de fabricação do veículo

source: Vehicle Plate Number
pt: Número da placa do veículo

source: Your Best Photo Here
pt: Sua melhor foto aqui

source: Update
pt: Atualizar

source: Please wait...
pt: Por favor, aguarde...

source: Home
pt: Início

source: Wallet
pt: Carteira

source: Activity
pt: Atividade

source: Account
pt: Conta

source: No wallet data available
pt: Nenhum dado da carteira disponível

source: Wallet Balance
pt: Saldo da Carteira

source: Payment Gateway
pt: Gateway de Pagamento

source: Add New
pt: Adicionar novo

source: No Cards yet!
pt: Nenhum cartão ainda!

source: Today
pt: Hoje

source: Complete Ride
pt: Concluir viagem

source: Cancel Ride
pt: Cancelar viagem

source: No rides yet.
pt: Nenhuma viagem ainda.

# error_with_msg
source: Error: {msg}
pt: Erro: {msg}

source: My Profile
pt: Meu Perfil

source: Change Password
pt: Alterar senha

source: Terms & Conditions
pt: Termos e Condições

source: Privacy Policy
pt: Política de Privacidade

source: Log Out
pt: Sair

source: Delete Account
pt: Deletar Conta

source: Language
pt: Idioma

# are_you_sure_msg
source: Are You Sure You Want to {msg} from App
pt: Tem certeza de que deseja {msg} do aplicativo

# see_you_next_ride
source: We hope to see you again soon for your next ride!
pt: Esperamos vê-lo novamente em sua próxima viagem!

source: Exit
pt: Sair

source: Cancel
pt: Cancelar

source: Location Permission Needed
pt: Permissão de Localização Necessária

# location_permission_msg
source: Please enable location access to use this feature.
pt: Por favor, habilite o acesso à localização para usar este recurso.

source: Grant Permission
pt: Conceder Permissão

# find_you_faster
source: Let’s Find You Faster!
pt: Vamos encontrá-lo mais rápido!

# find_you_faster_msg
source: Enable location access to get matched with nearby drivers quickly and easily.
pt: Ative o acesso à localização para encontrar motoristas próximos de forma rápida e fácil.

source: Skip for Now
pt: Pular por agora

source: Allow
pt: Permitir

source: Select Pickup location
pt: Selecione o local de partida

source: Confirm
pt: Confirmar

source: Pick-up
pt: Embarque

source: Stop point
pt: Ponto de parada

source: Destination
pt: Destino

source: Ride Preferences
pt: Preferências de Viagem

source: No Service Available
pt: Nenhum serviço disponível

source: Apply
pt: Aplicar

# ride_preferences_description
source: Select the type of ride that best suits your needs.
pt: Selecione o tipo de viagem que melhor atende às suas necessidades.

source: Initializing...
pt: Inicializando...

# select_service
source: Select a Service!
pt: Selecione um serviço!

source: Start Ride
pt: Iniciar viagem

source: Ride requested
pt: Viagem solicitada

# searching_for_driver
source: Searching for an online driver..
pt: Procurando por um motorista online...

source: Type a message
pt: Digite uma mensagem

# cancel_title
source: Tell Us Why You're Cancelling The Ride
pt: Conte-nos por que você está cancelando a viagem

# cancel_subtitle
source: Let us know the reason for canceling your ride.
pt: Informe-nos o motivo do cancelamento da viagem.

source: Go back to ride
pt: Voltar à viagem

source: Cancel the ride
pt: Cancelar a viagem

source: Trips
pt: Viagens

source: Estimated Time
pt: Tempo estimado

# ride_complete
source: Your Ride is Complete
pt: Sua viagem está concluída

# ride_feedback_prompt
source: We hope you had a smooth ride. Please complete your payment and rate your experience.
pt: Esperamos que você tenha tido uma viagem tranquila. Por favor, conclua o pagamento e avalie sua experiência.

source: Confirm Pay
pt: Confirmar Pagamento

source: Select payment method
pt: Selecione o método de pagamento

# payment_completed
source: Thank You! Payment Completed
pt: Obrigado! Pagamento concluído

# payment_confirmation
source: paid via {method}. We hope you had a great ride! Don't forget to leave a rating.
pt: Pago via {method}. Esperamos que tenha tido uma ótima viagem! Não se esqueça de deixar uma avaliação.

# share_experience
source: Share Your Experience!
pt: Compartilhe Sua Experiência!

# enter_experience
source: Enter your Experience!
pt: Digite Sua Experiência!

source: Submit
pt: Enviar

source: Service Charge
pt: Taxa de Serviço

source: Discount
pt: Desconto

source: Total Amount
pt: Valor Total

source: Please Select Payment Type
pt: Por favor, selecione o tipo de pagamento

source: No address found
pt: Nenhum endereço encontrado

source: Full Name
pt: Nome Completo

source: Mobile Number
pt: Número de Celular

source: Gender
pt: Gênero

# gender_required
source: Gender is required
pt: Gênero é obrigatório

source: Save
pt: Salvar

source: Current Password
pt: Senha Atual

source: New Password
pt: Nova Senha

source: Confirm New Password
pt: Confirme a Nova Senha

# all_rights_reserved
source: {msg} All rights reserved.
pt: {msg} Todos os direitos reservados.

source: Registration DONE!
pt: Registro Concluído!

# profile_under_review
source: Your Profile is Under Review
pt: Seu Perfil Está Sob Revisão

# profile_submitted_reviewed
source: Your profile has been submitted and is being reviewed. You will be notified when it is approved.
pt: Seu perfil foi enviado e está sendo revisado. Você será notificado quando for aprovado.

# enter_password
source: Enter your Password
pt: Digite sua Senha

# enter_password_description
source: Please enter your account password to continue.
pt: Por favor, digite a senha da sua conta para continuar.

source: Login
pt: Entrar

source: CLOSE
pt: FECHAR

# delete_account_confirmation
source: Are you sure you want to delete your account?
pt: Tem certeza de que deseja excluir sua conta?

# delete_account_warning
source: This action is permanent and cannot be undone.
pt: Esta ação é permanente e não pode ser desfeita.

source: Delete
pt: Excluir

source: Login with your Password
pt: Entrar com sua Senha

source: Use your password here
pt: Use sua senha aqui

source: Use OTP Instead
pt: Usar OTP em vez disso

source: Either phone number is null or password is empty
pt: O número de telefone é nulo ou a senha está vazia

source: Add Balance to Your Wallet
pt: Adicionar saldo à sua carteira

source: Top up your wallet securely and enjoy seamless payments.
pt: Recarregue sua carteira com segurança e aproveite pagamentos contínuos.

source: No Payment methods available
pt: Nenhum método de pagamento disponível

source: Select Card type
pt: Selecione o tipo de cartão

source: Enter Amount
pt: Digite o Valor

source: Enter a valid amount
pt: Digite um valor válido

source: Add Wallet
pt: Adicionar à Carteira

source: Form is not valid
pt: O formulário não é válido

source: Add Payment Gateway
pt: Adicionar Gateway de Pagamento

source: Cardholder Name
pt: Nome do Titular do Cartão

source: Enter cardholder name
pt: Digite o nome do titular do cartão

# card_number
source: Card no
pt: Número do Cartão

# write
source: Write {msg}
pt: Escreva {msg}

source: Enter valid card number
pt: Digite um número de cartão válido

source: Exp. Date
pt: Data de Validade

source: Pick a date
pt: Escolha uma data

source: Enter 3-digit CVV
pt: Digite o CVV de 3 dígitos

source: Country
pt: País

source: Select a country
pt: Selecione um país

source: Connection timeout with API server
pt: Tempo de conexão esgotado com o servidor API

source: Receive timeout with API server
pt: Tempo de recebimento esgotado com o servidor API

source: Send timeout with API server
pt: Tempo de envio esgotado com o servidor API

source: Bad certificate with API server
pt: Certificado inválido com o servidor API

# received_invalid_response_from_server
source: Received an invalid response from the server.
pt: Recebida uma resposta inválida do servidor.

source: Request to API server was cancelled
pt: Solicitação ao servidor API foi cancelada

source: Connection error with API server
pt: Erro de conexão com o servidor API

# no_internet_connection_please_check
source: No internet connection. Please check your internet connection.
pt: Sem conexão com a internet. Por favor, verifique sua conexão.

# unexpected_error_occurred
source: An unexpected error occurred
pt: Ocorreu um erro inesperado

source: Unexpected response format
pt: Formato de resposta inesperado

source: Bad request
pt: Solicitação inválida

source: Unauthorized access. Please login again.
pt: Acesso não autorizado. Por favor, faça login novamente.

source: Forbidden access. Please login again.
pt: Acesso proibido. Por favor, faça login novamente.

source: Validation error
pt: Erro de validação

source: Internal server error
pt: Erro interno do servidor

source: Something went wrong
pt: Algo deu errado

source: No internet connection.
pt: Sem conexão com a internet.

source: Request timed out. Please try again.
pt: Tempo de solicitação esgotado. Por favor, tente novamente.

# something_went_wrong_exclamation
source: Something went wrong!
pt: Algo deu errado!

source: Resource not found.
pt: Recurso não encontrado.

source: Unexpected Application Crash
pt: Falha inesperada do aplicativo

# app_encountered_unexpected_error
source: The app encountered an unexpected error and had to close. This could be caused by insufficient device memory, a bug in the app, or a corrupted file. Please restart the app or reinstall it if the issue continues.
pt: O aplicativo encontrou um erro inesperado e precisou ser fechado. Isso pode ser causado por memória insuficiente, um bug no app ou um arquivo corrompido. Reinicie o app ou reinstale se o problema continuar.

source: Contact Support
pt: Contatar Suporte

source: Let’s Ride
pt: Vamos Rodar

source: Location
pt: Localização

source: Your Balance
pt: Seu Saldo

source: Today's Earning
pt: Ganhos de Hoje

# your_ride_complete
source: Ride complete
pt: Viagem Concluída

source: Today's Activity
pt: Atividade de Hoje

source: View All
pt: Ver Tudo

source: Ride History
pt: Histórico de Viagens

source: Payment Received
pt: Pagamento Recebido

source: Payment Withdraw
pt: Saque de Pagamento

source: Current Balance
pt: Saldo Atual

source: Withdraw
pt: Sacar

source: Withdraw Your Earnings
pt: Saque Seus Ganhos

# withdraw_instruction
source: You've earned it! Choose where you want to send your money and hit withdraw.
pt: Você ganhou! Escolha para onde enviar seu dinheiro e clique em sacar.

source: Please enter amount
pt: Por favor, digite o valor

# withdrawal_success
source: Withdrawal Request Submitted Successfully!
pt: Solicitação de Saque Enviada com Sucesso!

# withdrawal_request_success
source: Success! You've requested {amount} withdrawal. Funds will be transferred to your selected account shortly.
pt: Sucesso! Você solicitou {amount} de saque. Os fundos serão transferidos para sua conta em breve.

source: Transactions
pt: Transações

source: Withdraw History
pt: Histórico de Saques

source: No transactions found
pt: Nenhuma transação encontrada

source: Method:
pt: Método:

source: Total Rides
pt: Total de Corridas

source: Total Distance
pt: Distância Total

source: Average Rating
pt: Avaliação Média

source: Payout Method
pt: Método de Pagamento

source: Theme
pt: Tema

source: Select Profile Image
pt: Selecionar Imagem de Perfil

source: Upload image
pt: Carregar imagem

# or_select_avatar
source: Or select an avatar from the list below:
pt: Ou selecione um avatar da lista abaixo:

source: Accept Ride
pt: Aceitar Corrida

source: Amount
pt: Valor

source: Rider Waiting — Move Now
pt: Passageiro Esperando — Mova-se Agora

# time_to_pickup
source: Time to pick up your rider! Follow the navigation and arrive without delay
pt: Hora de pegar seu passageiro! Siga a navegação e chegue sem atrasos

source: Go to Pickup Location
pt: Ir para o Local de Pickup

# arrived_pickup_point
source: You’ve Arrived at the Pickup Point
pt: Você Chegou ao Ponto de Pickup

# reached_pickup_wait
source: You’ve reached the pickup location. Please wait a few minutes for the rider to approach your vehicle.
pt: Você chegou ao local de pickup. Aguarde alguns minutos para o passageiro se aproximar do veículo.

# tap_to_confirm_arrival
source: Tap to Confirm Your Arrival
pt: Toque para Confirmar Sua Chegada

source: Pickup Rider
pt: Pegar Passageiro

# double_check_rider
source: Double-check the rider’s name and verify their destination before proceeding.
pt: Verifique o nome do passageiro e confirme o destino antes de prosseguir.

source: Confirm Pickup
pt: Confirmar Pickup

# all_set_start_ride
source: All Set? Start the Ride Now
pt: Tudo Pronto? Comece a Corrida Agora

# start_journey_navigation
source: Start the journey by following the in-app navigation. Make sure both parties are comfortable before beginning.
pt: Inicie a viagem seguindo a navegação do app. Certifique-se de que ambas as partes estão confortáveis antes de começar.

# tap_to_start_ride
source: Start Ride
pt: Toque para Começar a Corrida

# follow_directions_comfortable
source: Follow the directions, stay calm, and create a comfortable ride environment.
pt: Siga as instruções, mantenha a calma e proporcione um ambiente de viagem confortável.

# reached_passenger_destination
source: You’ve Reached the Passenger’s Destination.
pt: Você Chegou ao Destino do Passageiro.

# trip_ended_passenger_destination
source: The trip has ended as the passenger has reached their destination.
pt: A viagem terminou pois o passageiro chegou ao destino.

source: Reached Destination
pt: Destino Atingido

# trip_ended_wait_payment
source: The trip has ended. Wait for the passenger to complete their payment before closing the ride.
pt: A viagem terminou. Aguarde o passageiro completar o pagamento antes de encerrar a corrida.

source: Report Issue
pt: Reportar Problema

source: Ride Details
pt: Detalhes da Corrida

# textCopied
source: Text been copied
pt: Texto copiado

# reportIssueTitle
source: Something Went Wrong? Report an Issue
pt: Algo deu errado? Reporte um Problema

# reportIssueSubtitle
source: Tell us what went wrong. We’ll look into it immediately.
pt: Conte-nos o que deu errado. Iremos analisar imediatamente.

source: Report Type
pt: Tipo de Relatório

source: Select Report type
pt: Selecione o Tipo de Relatório

source: Details
pt: Detalhes

source: Write Issue Details
pt: Descreva os Detalhes do Problema

# insertAllData
source: Please insert all Data
pt: Por favor, insira todos os dados

# issueSubmitted
source: Your Issue Submitted Successfully
pt: Seu Problema foi Enviado com Sucesso

# thanksForReporting
source: Thanks for reporting. Our team will review your issue and get back to you shortly.
pt: Obrigado por reportar. Nossa equipe analisará o problema e retornará em breve.

source: Request Entity Too Large
pt: Entidade da Solicitação Muito Grande

source: Ride Charge
pt: Cobrança da Corrida

source: Expiry Date
pt: Data de Expiração

# yourAccountAlreadyActive
source: Your account is already active on another device. To use it here, the other device will be logged out.
pt: Sua conta já está ativa em outro dispositivo. Para usar aqui, o outro dispositivo será desconectado.

source: Logging in Somewhere Else
pt: Conectando-se em Outro Dispositivo

source: Stay on This Device
pt: Permanecer neste Dispositivo

source: or
pt: ou

# already_have_account
source: Already have an account?
pt: Já tem uma conta?

source: Sign in
pt: Entrar

# validator_email_required
source: Email is required
pt: E-mail é obrigatório

# validator_email_invalid
source: Enter a valid email
pt: Insira um e-mail válido

# validator_phone_required
source: Phone number is required
pt: Número de telefone é obrigatório

# validator_phone_invalid
source: Enter a valid phone number
pt: Insira um número de telefone válido

# validator_number_required
source: Number is required
pt: Número é obrigatório

# validator_number_invalid
source: Enter a valid number
pt: Insira um número válido

# validator_password_required
source: Password is required
pt: Senha é obrigatória

# validator_password_too_short
source: Password must be at least 6 characters
pt: A senha deve ter pelo menos 6 caracteres

# validator_name_required
source: Name is required
pt: Nome é obrigatório

# validator_name_invalid
source: Enter a valid name
pt: Insira um nome válido

source: Password
pt: Senha

source: Button
pt: Botão

# double_tap_create_account
source: Double tap to create your account
pt: Toque duas vezes para criar sua conta

# terms_conditions_checkbox
source: Terms and Conditions Checkbox and Description
pt: Caixa de seleção de termos e condições e descrição

source: Registration Form Fields
pt: Campos do formulário de registro

source: Sign In Form Fields
pt: Campos do formulário de login

source: Registration Heading
pt: Cabeçalho de registro

source: Sign In Heading
pt: Cabeçalho de login

# sign_in_with_email_phone
source: Sign in with your email or phone number
pt: Entre com seu e-mail ou número de telefone

# email_or_phone
source: Email or Phone Number
pt: E-mail ou número de telefone

source: Enter Your Password
pt: Digite sua senha

source: Forget password?
pt: Esqueceu a senha?

source: Phone verification
pt: Verificação do telefone

# enter_otp_code
source: Enter your OTP code
pt: Insira seu código OTP

# enter_otp_fields
source: Enter your OTP Fields
pt: Insira os campos do OTP

source: Didn’t receive code?
pt: Não recebeu o código?

source: Resend again
pt: Reenviar novamente

source: OTP resend button
pt: Botão de reenviar OTP

source: Verify
pt: Verificar

source: OTP verify button
pt: Botão de verificação de OTP

source: First Name
pt: Primeiro nome

source: Last Name
pt: Sobrenome

source: Sign up with Gmail
pt: Cadastre-se com Gmail

source: Sign up with Facebook
pt: Cadastre-se com Facebook

source: Sign up with Apple
pt: Cadastre-se com Apple

# enter_otp_in_fields
source: Enter OTP in the fields
pt: Digite o OTP nos campos

# enter_valid_email_or_phone
source: Enter a valid email or phone number
pt: Digite um e-mail ou número de telefone válido

# email_or_phone_required
source: Email or Phone number required
pt: E-mail ou número de telefone obrigatório

source: Back
pt: Voltar

source: Date of Birth
pt: Data de nascimento

source: Nationality
pt: Nacionalidade

source: Tax Number
pt: Número fiscal

source: Social Security Number
pt: Número de Segurança Social

source: Legal Documents
pt: Documentos Legais

source: Add Legal Documents
pt: Adicionar Documentos Legais

source: Enter legal documents to complete profile
pt: Introduza os documentos legais para completar o perfil

source: Citizen Card
pt: Cartão de Cidadão

source: Upload Front
pt: Carregar Frente

source: Upload Back
pt: Carregar Verso

source: TVDE Driver Certificate
pt: Certificado de Motorista TVDE

source: Criminal Record Certificate
pt: Certificado de Registo Criminal

source: Residence Permit (if non-EU)
pt: Autorização de Residência (se não for da UE)

source: Tips Withdraw
pt: Levantamento de gorjetas
